s_hello = """"Привет! 👋
Меня зовут NEXTON 😊
Я Бот центра развлечений NEXT 🤖 
Я приготовил для тебя подарок 🎁
Давай сначала познакомимся 😉
Как тебя зовут?👇"""

s_name_remind = """Давай сначала познакомимся 😉
Как тебя зовут?👇"""

s_menu = """Приглашай друзей и получай от меня новые подарки за каждого нового друга 🤗
✅Чтобы пригласить друга, нажимай на кнопку ""Пригласить_друга"" и отправь ему появившуюся ссылку или QR код. ⤵️"""

s_phone = """Приятно познакомиться! 🤗
Чтобы подарить подарок, мне нужен твой контакт 📲
Нажми на кнопку внизу ""отправить телефон""⤵️"""

s_phone_error = """Чтобы подарить подарок, мне нужен твой контакт 📲
Нажми на кнопку внизу ""отправить телефон""⤵️"""

s_phone_remind = "Кажется, кто-то обещал отправить номер телефона, но так и не сделал этого :( Жду..."

s_birth = """Хорошо! 👍
И последнее, когда у тебя День рождения❓
Формат: ДД.ММ.ГГГГ 
Например: 05.12.2010"""

s_birth_error = "Что-то не так, попробуй ещё раз!"
s_birth_cheat = "Какой-то странный возраст. Не верю! Отвечай честно."
s_birth_remind = "Кажется, кто-то обещал отправить свою дату рождения, но так и не сделал этого :( Жду..."

# s_gift = "Поздравляем! Ваш подарок: "
s_gift = """Поздравляю! 🎉
Твой подарок 👉"""

s_gifts_addr = """✅Чтобы получить подарок, приходи в один из наших Центров, назови свое имя и телефон на кассе. 
📍Наши центры находятся в Алматы:
• ТРЦ Esentai Mall на 4 этаже (пр. Аль-Фараби, 77/8)
• ТРЦ Aport Mall на 3 этаже (пр. Раймбека)

📍Приглашай друзей и получай подарки за это 😉"""

s_gifts = "🎁Твои подарки:\n"

s_gift_end = """Если ты не получил свой подарок 😔 пиши мне в телеграм 📱@nexton_bot или набери меня на телефон 📞+7(708)548-48-98. 
Так же ты можешь связаться со мной через инстаграм 📷https://www.instagram.com/next.almaty/"""

s_qr = """Дай своему другу отсканировать этот qr-код или отправьте ему ссылку ниже ⤵️"""

s_text = """Прости, мой искусственный интеллект еще не достаточно совершенен и я не могу отвечать на все твои сообщения 😔
Если у тебя остались вопросы, напиши мне в телеграм 📱@nexton_bot или позвони мне 📞+7(708)548-48-98.
И присоединяйся к нам в инстаграм 📷https://www.instagram.com/next.almaty/"""

s_error = "К сожалению, что-то пошло не так. Попробуйте позже..."

s_birth_14 = """Привет! 
Поздравляю тебя с наступающим Днем Рождения 🎂🎉🎈
"""

s_birth_7 = """Привет!
Осталась всего неделя до твоего Дня рождения 😱
Завтра последний день, когда ты можешь забрать свой подарок 😬 
Послезавтра код твоего подарка станет недействительным и ты не сможешь забрать свой подарок 😭"""

s_birth_0 = """🎉С Днем Рождения! 🎉
Желаю тебе счастья и новых открытий! 🤗
А также много, много друзей! 💪
И если кто-то из них еще не знаком со мной 🤔 то приглашай его с помощью кнопки 👉""Пригласить_друзей"" и получай еще больше подарков на свой День Рождения 😉"""
